from aiogram.utils.formatting import Text, as_line, as_marked_section

WELCOME_TEACHER_TEXT = Text(
    "Добро пожаловать в панель управления!",
    as_line(""),
    as_marked_section(
        "Здесь вы можете:",
        *[
            "🤖 Создавать курсы с помощью AI",
            "👥 Управлять списком студентов",
            "📈 Отслеживать прогресс студентов",
        ],
        marker="• "
    ),
)

WELCOME_STUDENT_TEXT = Text(
    "Я — твой помощник в обучении.",
    as_line(),
    as_marked_section(
        "Здесь ты можешь:",
        *[
            "🔑 Зарегистрироваться на курс",
            "📊 Отслеживать свою успеваемость",
            "💬 Общаться с AI преподавателем"
        ],
        marker="• "
    )
)
